Arithmetic Operators

In [3]:
# Addition Operator
3+5

8

In [4]:
# Subtraction
54-46

8

In [5]:
# Multiplication
2*3

6

In [7]:
# Division
35/7

5.0

In [9]:
"boss"+20
"boss"+"20"

TypeError: can only concatenate str (not "int") to str

In [10]:
"boss"+"20"

'boss20'

In [11]:
"boss"*5

'bossbossbossbossboss'

Comparison Operators

In [12]:
# greater than
45>54

False

In [13]:
# less than
45<52

True

In [14]:
25*46 < 54*64

True

In [15]:
54==54

True

Logical Operators

In [18]:
# and operator
# Returns the first false value; if not found returns last.
0 and 3

0

In [19]:
# or operator
# Returns first true value; if not found returns last.
3 or 5

3

Variables and data types in python

In [20]:
# Variables are names bounded to objects.
a =5
print(a)

5

In [21]:
A = 4
print(a)
print(A)

5
4

In [22]:
# How variables work in Python
a = 7
b = a
a = 3
print(a)
print(b)

3
7

In [24]:
a =5
_a = 6
print(a)
print(_a)

5
6

In [27]:
# Data types
a = 5
type(a)

int

In [28]:
b = "boss"
type(b)

str

# Conditional Statements

In [33]:
a=9
if(a==5):
    b=5
elif(a==6):
    b=6
else:
    b=7
print(b)

7

In [34]:
# Problem 1 : Take a variable x and print "Even" if the number is divisible by 2, otherwise print"Odd"

x=5
if(x%2==0):
    print("Even")
else:
    print("Odd")

Odd

In [35]:
# Problem 2 : Take a variable y and print "Grade A" if y is greater than 90, "Grade B" if y is greater than 60 but less than or equal to 90 and "Grade F" Otherwise.

y = 50
if(y>90):
    print("Grade A")
elif(y>60 and y<=90):
    print("Grade B")
else:
    print("Grade F")

Grade F

Looping constructs

In [36]:
# For Loop
for i in range(10):
    print("python is awesome")

python is awesome
python is awesome
python is awesome
python is awesome
python is awesome
python is awesome
python is awesome
python is awesome
python is awesome
python is awesome

In [39]:
for i in range(5,10):
    print(i)

5
6
7
8
9

In [40]:
for i in range(5,10,2):
    print(i)

5
7
9

In [37]:
# Problem 1 : Write a for loop to print all the numbers between 10 and 50.

for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

In [38]:
# Problem 2: Write a for loop to print all the odd numbers between 10 and 50.

for i in range(11,50):
    if(i%2!=0):
        print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

In [41]:
for i in range(10,5):
    print(i)

In [1]:
for i in range(10,5,-2):
    print(i)

10
8
6

Functions

In [ ]:
# Re-usable piece of code.
# Created for solving specific problem.

# def function_name(arguments):
#     statement1
#     statement2
#     ...
#     ...
#     ...
#     return statement

# def area_circle(radius):
#     area = 3.14*r*r
#     return area

In [2]:
# Problem : Create a function that takes two numbers as arguments and returns the greater of the two.

def compare(a,b):
    if(a>b):
        greater = a
    else:
        greater = b
    return greater

In [3]:
compare(10,50)

50

In [4]:
compare(14,5)

14

In [5]:
# Data Structures Lists and Dictionaries
list1 = [1,2,3,4,5]
list2 = ['mix',5,'tool']

#indes   0    1     2  3   4     5
list3 = [1,'python',2,'is',3,'Awesome']
list3[1]

'python'

In [6]:
list3[1:4]

['python', 2, 'is']

In [7]:
list3[-1]

'Awesome'

In [8]:
list3.append(4)

In [9]:
list3

[1, 'python', 2, 'is', 3, 'Awesome', 4]

In [12]:
list3.extend([5,6])

In [13]:
list3

[1, 'python', 2, 'is', 3, 'Awesome', 4, 5, 6]

In [14]:
list3.append([7,8])

In [15]:
list3

[1, 'python', 2, 'is', 3, 'Awesome', 4, 5, 6, [7, 8]]

In [16]:
list3.remove(2)

In [17]:
list3

[1, 'python', 'is', 3, 'Awesome', 4, 5, 6, [7, 8]]

In [18]:
del list3[3]

In [19]:
list3

[1, 'python', 'is', 'Awesome', 4, 5, 6, [7, 8]]

In [20]:
for i in list3:
    print(i)

1
python
is
Awesome
4
5
6
[7, 8]

In [21]:
# implementing list in python

#creating a list

marks=[1,2,3,4,5,6,7,8,9,10]

In [22]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [23]:
marks[5]

6

In [24]:
marks[0:6]

[1, 2, 3, 4, 5, 6]

In [25]:
# adding an element
marks.append(11)

In [ ]:
marks

In [26]:
marks.extend([12,13])

In [27]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [28]:
marks.append([14,15])

In [29]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, [14, 15]]

In [30]:
# deleting elements

marks.remove([14,15])

In [31]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [32]:
del marks[0]

In [33]:
marks

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [34]:
# accessing list elements

for mark in marks:
    print(mark)

2
3
4
5
6
7
8
9
10
11
12
13

In [35]:
for mark in marks:
    print(mark+1)

3
4
5
6
7
8
9
10
11
12
13
14

In [36]:
marks

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [37]:
# Dictionary

dict1 ={'Ramesh': 150,'Suresh': 146,'Sudesh': 160}
dict2={'Ramesh':[150,46],'Suresh':[146,58],'Sudesh':[160,50]}

In [39]:
dict2['Suresh']

[146, 58]

In [40]:
dict2['Boss']=[176,75]

In [41]:
dict2

{'Ramesh': [150, 46],
 'Suresh': [146, 58],
 'Sudesh': [160, 50],
 'Boss': [176, 75]}

In [42]:
dict2.update({'sunil':[150,70],'disha':[155,80]})

In [43]:
dict2

{'Ramesh': [150, 46],
 'Suresh': [146, 58],
 'Sudesh': [160, 50],
 'Boss': [176, 75],
 'sunil': [150, 70],
 'disha': [155, 80]}

In [44]:
del dict2['Ramesh']

In [45]:
dict2

{'Suresh': [146, 58],
 'Sudesh': [160, 50],
 'Boss': [176, 75],
 'sunil': [150, 70],
 'disha': [155, 80]}

In [46]:
# implementing dictionaries in python

#creating a dictionary

marks={'history':45,'Geography':54,'hindi':56}

In [47]:
marks

{'history': 45, 'Geography': 54, 'hindi': 56}

In [48]:
#access elements

marks['Geography']

54

In [49]:
#adding elements

marks['english']=47

In [50]:
marks

{'history': 45, 'Geography': 54, 'hindi': 56, 'english': 47}

In [51]:
marks.update({'chemistry':89,'Physics':98})

In [52]:
marks

{'history': 45,
 'Geography': 54,
 'hindi': 56,
 'english': 47,
 'chemistry': 89,
 'Physics': 98}

In [53]:
del marks['hindi']

In [54]:
marks

{'history': 45, 'Geography': 54, 'english': 47, 'chemistry': 89, 'Physics': 98}

In [ ]:
# understanding standard libraries, modules, and package in python.

# example : from Operator.Arithmetic import addition
# we get addition(3,5)

#or
# from Operator import Arithmetic
# we get Arithmetic.addition(3,5)

In [64]:
# Pandas
# Reading csv and excel file

#importing pands library

import pandas as pd

# reading the csv file

df=pd.read_csv("read_csv\data.csv")

In [65]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
# reading excel file
import pandas as pd
df1=pd.read_excel("read_csv\data.xlsx")

In [75]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [76]:
# import the required libraries

import pandas as pd

In [78]:
# reading the dataset

df=pd.read_csv("read_csv\data.csv")

In [79]:
df.shape

(891, 12)

In [80]:
# top 5 rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [81]:
# bottom 5 rows

df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [82]:
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [83]:
# seeing the names of columns in dataframe

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [87]:
# selecting a single column

df['PassengerId']

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [88]:
# selecting multiple columns using names

df[['PassengerId','']]

     PassengerId            Ticket
0              1         A/5 21171
1              2          PC 17599
2              3  STON/O2. 3101282
3              4            113803
4              5            373450
..           ...               ...
886          887            211536
887          888            112053
888          889        W./C. 6607
889          890            111369
890          891            370376

[891 rows x 2 columns]

In [89]:
# indexing selection

import pandas as pd
df=pd.read_csv("read_csv\data.csv")

In [90]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [91]:
# selecting a single column by name

df['PassengerId']

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [92]:
# selecting multiple columns using column names

df[['PassengerId','Ticket']]

     PassengerId            Ticket
0              1         A/5 21171
1              2          PC 17599
2              3  STON/O2. 3101282
3              4            113803
4              5            373450
..           ...               ...
886          887            211536
887          888            112053
888          889        W./C. 6607
889          890            111369
890          891            370376

[891 rows x 2 columns]

In [93]:
# selecting rows by their positions

df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [94]:
# selecting columns by their position

df.iloc[:,:2]

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

In [95]:
df[df['PassengerId']==2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C